#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601814680]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601814678]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601814693]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601814685]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601814683]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601814702]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601814690]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601814682]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601814697]
data.sakuracloud_archive.ubuntu_archive: Read complete after 3s [id=113600510456]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601814703]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601814692]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601814684]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601814705]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601814686]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601814679]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601814704]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601814694]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601814696]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601814688]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601814681]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601814687]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601814700]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601814699]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601814749]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601814715]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601814739]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601814736]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601814716]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601814713]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601814711]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601814714]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601814718]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601814717]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601814712]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601814706]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19815]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601814705" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601814749" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601814684" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601814736" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601814686" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601814739" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601814679" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601814706" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814699" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601814714" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814700" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601814713" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814694" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601814718" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814688" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601814715" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814681" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601814711" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814696" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601814716" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814687" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601814712" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601814704" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601814717" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601814705",
        ] -> (known after apply)
        id                = "113601814749"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601814684",
        ] -> (known after apply)
        id                = "113601814736"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601814686",
        ] -> (known after apply)
        id                = "113601814739"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601814679",
        ] -> (known after apply)
        id                = "113601814706"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814699",
          - "113601814702",
        ] -> (known after apply)
        id                = "113601814714"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814700",
          - "113601814690",
        ] -> (known after apply)
        id                = "113601814713"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814694",
          - "113601814697",
        ] -> (known after apply)
        id                = "113601814718"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814688",
          - "113601814692",
        ] -> (known after apply)
        id                = "113601814715"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814681",
          - "113601814703",
        ] -> (known after apply)
        id                = "113601814711"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814696",
          - "113601814693",
        ] -> (known after apply)
        id                = "113601814716"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814687",
          - "113601814683",
        ] -> (known after apply)
        id                = "113601814712"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601814704",
          - "113601814682",
        ] -> (known after apply)
        id                = "113601814717"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>